/********************************************************************
 * tate   : 縦線の本数を表す変数
 * yoko   : 横線の本数を表す変数
 * Yokosen: 横線の位置の情報を表す整数の配列
 *          例) Yokosen[y] = x <=> 上からy番目の横線が左からx番目の縦線と
 *              x+1番目の縦線を結ぶことを意味する。
 * 
 * 配列の番号は１から始まっているのでどの配列も最初の要素は捨て要素になっている。
 ********************************************************************/
const tate    = 3;
const yoko    = 4;
const Yokosen = ["捨て要素", 2, 1, 2, 1];

/********************************************************************
 * 図２
 ********************************************************************/
for (let y=1; y<=yoko; y++) {
    var x = 1;
    while (x <= tate) {
        if (Yokosen[y] == x) {
            process.stdout.write("┣");
            process.stdout.write("┫");
            x = x + 2;
        } else {
            process.stdout.write("┃");
            x = x + 1;
        }
    }
    console.log("");
}